//管理员模式

//*********************************************************************

//修改站点名称
xiugai1(adj *a)
{
int i,j;
int mima=23;
char na[20],na2[20];
while(123!=mima)
{
printf("请输入管理员密码(默认123)，输入0返回:");
scanf("%d",&mima);
printf("\n");
if(mima==0)
return;
}
printf("请输入要修改的站点名：");
scanf("%s",na);
printf("\n");
printf("请输入修改后的站点名：");
scanf("%s",na2);
for(i=1;i<=a->diannum;i++)
{
if(strcmp(a->dian[i].name,na)==0)
strcpy(a->dian[i].name,na2);
}
}

//***********************************************************************

xiugai2(adj *a)
{
int i,j;
int m,n;
int mima=23;
char na[20],na2[20];
while(123!=mima)
{
printf("请输入管理员密码(默认123)，输入0返回:");
scanf("%d",&mima);
printf("\n");
if(mima==0)
return;
}
printf("请输入堵塞的俩个站点：");
scanf("%s %s",na,na2);
for(i=1;i<=a->diannum;i++)
if(strcmp(a->dian[i].name,na)==0)
m=a->dian[i].num;
for(i=1;i<=a->diannum;i++)
if(strcmp(a->dian[i].name,na2)==0)
n=a->dian[i].num;
a->xiannum=a->xiannum+1;
a->c[m][n]=maxnum;
a->c[n][m]=maxnum;
}

//**********************************************************************


xiugai3(adj *a)
{
int i,j;
int m,n;
int mima=23;
char na[20],na2[20];
while(123!=mima)
{
printf("请输入管理员密码(默认123)，输入0返回:");
scanf("%d",&mima);
printf("\n");
if(mima==0)
return;
}
printf("请输入新增路线的俩个站点：");
scanf("%s %s",na,na2);
for(i=1;i<=a->diannum;i++)
if(strcmp(a->dian[i].name,na)==0)
m=a->dian[i].num;
for(i=1;i<=a->diannum;i++)
if(strcmp(a->dian[i].name,na2)==0)
n=a->dian[i].num;
a->xiannum=a->xiannum-1;
a->c[m][n]=1;
a->c[n][m]=1;
}

//************************************************************************

print1()
{
printf("***********************************************************\n");
printf("                     输入1查询北京地铁                     \n");
printf("                     输入2查询西安地铁                     \n");
printf("                     输入3查询广州地铁（数据未载入）       \n");
printf("                     输入4查询上海地铁（数据未载入）       \n");
printf("                     输入5查询南京地铁（数据未载入）       \n");
printf("                     输入6查询天津地铁（数据未载入）       \n");
printf("                     输入7查询重庆地铁（数据未载入）       \n");
printf("                     输入8退出地铁查询系统                 \n");
printf("***********************************************************\n");
}

//*****************************************************************************

print2()
{
printf("***********************************************************\n");
printf("                    输入1   输出所有站点                   \n");
printf("                    输入2   输出所有线路                   \n");
printf("                    输入3   查询地铁时间                   \n");
printf("                    输入4   查询地铁路线                   \n");
printf("                    输入5   进入地铁管理                   \n");
printf("                    输入6   保存并退出                     \n");
printf("                    输入7   直接退出                       \n");
printf("***********************************************************\n");
}

//*****************************************************************************


print3()
{
printf("***********************************************************\n");
printf("                   输入1    修改地铁站名                   \n");
printf("                   输入2    堵塞路线录入                   \n");
printf("                   输入3    新增路线输入                   \n");
printf("                   输入4    退出                           \n");
printf("***********************************************************\n");
}


//******************************************************************************

print0()
{
printf("***********************************************************\n");
printf("                                                           \n");
printf("                     欢迎来到地铁管理系统V1.0              \n");
printf("                                                           \n");
printf("                                                 -By Cheng \n\n");
printf("***********************************************************\n");
}
